# Questions 1

How to import pandas and check the version?

#### Answer

In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

1.0.5

# Questions 2

How to create a series from a numpy array?

#### Answer

import pandas, import numpy, numpy array that was given, and forming series using pandas_name.series(numpy_name)

In [27]:
# import pandas
import pandas as pd
# import numpy
import numpy as np
# numpy array
np_array = np.array([4, 7, 9, 10])
print("NumPy array:")
print(np_array)
# forming series
new_series = pd.Series(np_array)
print("Converted Pandas series:")
print(new_series)

NumPy array:
[ 4  7  9 10]
Converted Pandas series:
0     4
1     7
2     9
3    10
dtype: int32

# Questions 3

How to convert the index of a series into a column of a dataframe?

#### Answer

In [28]:
# Creating the dataframe df 
df = pd.DataFrame({'ID': ['AB123', 'AG754', 'FC704', 'KR937'], 
                   'Name': ['Ima', 'Amel', 'Fiya', 'Nuri'], 
                   'Grade': ['A', 'A', 'C', 'B']}) 
  
# Printing the dataframe 
df

      ID  Name Grade
0  AB123   Ima     A
1  AG754  Amel     A
2  FC704  Fiya     C
3  KR937  Nuri     B

Method 1: The simplest method is to create a new column and pass the indexes of each row into that column by using the Dataframe.index function.

In [29]:
df = pd.DataFrame({'ID': ['AB123', 'AG754', 'FC704', 'KR937'], 
                   'Name': ['Ima', 'Amel', 'Fiya', 'Nuri'], 
                   'Grade': ['A', 'A', 'C', 'B']}) 
  
# Printing the dataframe 
df['index'] = df.index 
df

      ID  Name Grade  index
0  AB123   Ima     A      0
1  AG754  Amel     A      1
2  FC704  Fiya     C      2
3  KR937  Nuri     B      3

Method 2: We can also use the Dataframe.reset_index function to convert the index as a column. The inplace parameter reflects the change in the dataframe to stay permanent.

In [30]:
df = pd.DataFrame({'ID': ['AB123', 'AG754', 'FC704', 'KR937'], 
                   'Name': ['Ima', 'Amel', 'Fiya', 'Nuri'], 
                   'Grade': ['A', 'A', 'C', 'B']}) 
  
# Printing the dataframe 
df.reset_index(level=0, inplace=True) 
df

   index     ID  Name Grade
0      0  AB123   Ima     A
1      1  AG754  Amel     A
2      2  FC704  Fiya     C
3      3  KR937  Nuri     B

# Questions 4

Write the code to list all the datasets available in seaborn library.
Load the 'mpg' dataset
Note: mpg dataset will be read from seaborn module in the manner sir has already shown(provided in the
materials folder)

#### Answer

In [10]:
import seaborn as sb

In [11]:
print(sb.get_dataset_names())

c:\users\my computer\appdata\local\programs\python\python37\lib\site-packages\seaborn\utils.py:384: GuessedAtParserWarning: No parser was explicitly specified, so I'm using the best available HTML parser for this system ("html.parser"). This usually isn't a problem, but if you run this code on another system, or in a different virtual environment, it may use a different parser and behave differently.

The code that caused this warning is on line 384 of the file c:\users\my computer\appdata\local\programs\python\python37\lib\site-packages\seaborn\utils.py. To get rid of this warning, pass the additional argument 'features="html.parser"' to the BeautifulSoup constructor.

  gh_list = BeautifulSoup(http)

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'tips', 'titanic']

In [17]:
df = sb.load_dataset('mpg')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

# Questions 5

Which country origin cars are a part of this dataset?

In [21]:
pd.DataFrame(df['origin'].unique(), columns=['origin'])

   origin
0     usa
1   japan
2  europe

#### Answer

USA, JAPAN, and EUROPE

# Questions 6

Extract the part of the dataframe which contains cars belonging to 'usa'

#### Answer

In [25]:
df_usa = df[df['origin'] == 'usa']
df_usa

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
392,27.0,4,151.0,90.0,2950,17.3,82,usa,chevrolet camaro
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [26]:
# reset index of df_usa
df_usa_reset = df_usa.reset_index()
df_usa_reset

,index,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...,...
244,392,27.0,4,151.0,90.0,2950,17.3,82,usa,chevrolet camaro
245,393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
246,395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
247,396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
248,397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10